# Реализовать скрипт проверки типа данных каждого элемента
myList=[2.5, 8, "Hello", -1.578,]

for i  in myList:
    myList = [i]
    print(type(i), myList)


    

